app/controllers/physicians_controller.rb

SELECT "physicians".* FROM "physicians" WHERE (postal_code like '%01234%') ORDER BY created_at DESC
---
  def index
    @physicians = Physician.all